{
    "code": "CombFrNm03",
    "meta": {},
    "text": "Realiza el siguiente ejercicio de fracciones con operaciones combinadas. Aplica jerarquía de las operaciones para resolverlo:",
    "type": "lvltutor",
    "initialExpression":"\\frac{1}{4} \\div  \\frac{2}{3} + \\frac{1}{4}",
    "steps": [
      {
        "KCs": ["DivFrac", "MultFrac"],
        "hints": [
          {
            "hintId": 0,
            "hint": "Realiza las operaciones matemáticas siguiendo la jerarquía: paréntesis, potencia, multiplicación y división (de izquierda a derecha), y finalmente suma y resta (de izquierda a derecha)."
          },

          { "hintId": 1,
            "hint": "Primero resuelve la división de fracciones, que tiene prioridad sobre la suma."
          },
          { "hintId": 2,
            "hint": "Recuerda que para dividir fracciones, multiplica la fracción dividendo por el inverso de la fracción divisor."
          },

          {
            "hintId": 3,
            "hint": "División de fracciones: ",
            "expression": "\\frac{a}{b} \\div \\frac{c}{d} = \\frac{a \\cdot d}{b \\cdot c}"
          },

          { "hintId": 4,
            "hint": "La respuesta es: ",
            "expression": "\\frac{3}{8}"
          }
        ],
        "stepId": "0",
        "values": [
          { "name": "a", "value": 1 },
          { "name": "b", "value": 2 }
        ],
        "answers": [{ "answer": ["\\frac{3}{8}"], "nextStep": "1" }],
        "summary": "1) En un ejercicio de operaciones combinadas, partimos resolviendo la operación que tiene prioridad ante las demás operaciones. El orden de priorización es el siguiente: paréntesis, potencia, multiplicación y división (de izquierda a derecha), y finalmente suma y resta (de izquierda a derecha).",
        "stepTitle": "Comienza resolviendo sólo la operación que tiene prioridad y escribe su resultado abajo.",
        "correctMsg": "¡Bien! La operación con prioridad es la división y la has resuelto.",
        "validation": "evaluateAndCount",
        "incorrectMsg": "Revisa que la expresión ingresada este correcta.",
        "displayResult": ["\\frac{3}{8}"],
        "matchingError": []
      },
      {
        "KCs": ["STFrac"],
        "hints": [
          {
            "hintId": 0,
            "hint": "La sección que queremos reemplazar es aquella que resolviste en el paso anterior, específicamente:",
            "expression": "\\textcolor{Goldenrod}{\\frac{1}{4} \\div  \\frac{2}{3}}  + \\frac{1}{4}"
          },
          { "hintId": 1,
            "hint": "Recuerda escribir la expresión completa!! "
          },

          { "hintId": 2,
            "hint": "La respuesta es: ",
            "expression": "\\frac{3}{8} + \\frac{1}{4}"
          }
        ],
        "stepId": "1",
        "values": [
          { "name": "a", "value": 1 },
          { "name": "b", "value": 2 }
        ],
        "answers": [{ "answer": ["\\frac{3}{8} + \\frac{1}{4}"], "nextStep": "1" }],
        "summary": "2) Sustituir los resultados obtenidos en la expresión original facilita la resolución del problema, haciendo el proceso más manejable y permitiendo un enfoque paso a paso más claro y eficiente.",
        "stepTitle": "Sustituye el resultado anterior en la expresión original, sin resolver aún!.",
        "correctMsg": "Has logrado reducir la expresión original",
        "validation": "evaluateAndCount",
        "incorrectMsg": "Revisa que la expresión ingresada este correcta.",
        "displayResult": ["\\frac{3}{8} + \\frac{1}{4}"],
        "matchingError": []
      },
      {
        "KCs": ["MCM", "AmpFrac"],
        "hints": [
          {
            "hintId": 0,
            "hint": "Recuerda, para determinar cual es el denominador común debes buscar el MCM de los denominadores de las fracciones con las que estas trabajando."
          },
          { "hintId": 1,
            "hint": "El denominador común es 8. Ahora, ajusta las fracciones del ejercicio creando fracciones equivalentes con el mismo denominador común."
          },

          { "hintId": 2,
            "hint": "Multiplica el numerador y el denominador de cada fracción por el factor necesario (amplifica) para alcanzar el denominador común que calculaste en el paso anterior. No olvides escribir la expresión completa en tu respuesta."
          },

          { "hintId": 3,
            "hint": "La respuesta es: ",
            "expression": "\\frac{3}{8} + \\frac{2}{8}"
          }
        ],
        "stepId": "2",
        "values": [
          { "name": "a", "value": 1 },
          { "name": "b", "value": 2 }
        ],
        "answers": [{ "answer": ["\\frac{3}{8} + \\frac{2}{8}"], "nextStep": "1" }],
        "summary": "2) Determinamos el denominador común. Este es el MCM de los denominadores de las fracciones con las que se trabaja. Para igualar los denominadores de las fracciones, multiplicamos cada fracción por un factor que haga que su denominador coincida con el denominador común deseado. Este procedimiento facilita la suma al permitir trabajar con fracciones que comparten el mismo denominador.",
        "stepTitle": "Ajusta las fracciones del ejercicio creando fracciones equivalentes con el mismo denominador común.",
        "correctMsg": "Has conseguido que todas las fracciones en el ejercicio compartan el mismo denominador.",
        "validation": "evaluateAndCount",
        "incorrectMsg": "Revisa que la expresión ingresada este correcta.",
        "displayResult": ["\\frac{3}{8} + \\frac{2}{8}"],
        "matchingError": []
      },
      {
        "KCs": ["SRFrac", "IdenDenominador", "IdenNumerador"],
        "hints": [
          {
            "hintId": 0,
            "hint": "No olvides que al sumar fracciones con denominadores iguales, el valor del denominador se mantiene sin cambios en la fracción resultante y el valor del numerador se obtiene al sumar todos los numeradores de las fracciones que se están sumando."
          },
          { "hintId": 1,
            "hint": "En este ejercicio no hay que simplificar."
          },

          { "hintId": 2,
            "hint": "La respuesta es: ",
            "expression": "\\frac{5}{8}"
          }
        ],
        "stepId": "3",
        "values": [
          { "name": "a", "value": 1 },
          { "name": "b", "value": 2 }
        ],
        "answers": [{ "answer": ["\\frac{5}{8}"], "nextStep": "1" }],
        "summary": "3) Resolvemos todas las operaciones pendientes, teniendo en cuenta la jerarquía de las operaciones. Y, si es posible, simplificamos el resultado. En caso contrario, escribimos directamente el resultado obtenido.",
        "stepTitle": "Escribe el resultado de la resta de fracciones y, si es posible, simplifica el resultado. En caso contrario, escribe directamente el resultado obtenido.",
        "correctMsg": "Has resuelto el ejercicio de fracciones con operaciones combinadas",
        "expression": "\\frac{3}{8} + \\frac{2}{8}",
        "validation": "evaluateAndCount",
        "incorrectMsg": "Revisa que la expresión ingresada este correcta.",
        "displayResult": ["\\frac{5}{8}"],
        "matchingError": []
      }
    ],
    "title": "Ejercicio de fracciones con Operaciones combinadas"
  }  
